In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("Social_Network_Ads.csv")
df.head(10)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0
7  15694829  Female   32           150000          1
8  15600575    Male   25            33000          0
9  15727311  Female   35            65000          0

In [3]:
df=pd.get_dummies(df)
df.head(10)

    User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0  15624510   19            19000          0              0            1
1  15810944   35            20000          0              0            1
2  15668575   26            43000          0              1            0
3  15603246   27            57000          0              1            0
4  15804002   19            76000          0              0            1
5  15728773   27            58000          0              0            1
6  15598044   27            84000          0              1            0
7  15694829   32           150000          1              1            0
8  15600575   25            33000          0              0            1
9  15727311   35            65000          0              1            0

In [4]:
x1=df['Age']

In [5]:
x2=df['EstimatedSalary']

In [6]:
new_Age=22
new_salary=25000

In [7]:
X1_sub=(new_Age-x1)
X1_sub

0       3
1     -13
2      -4
3      -5
4       3
       ..
395   -24
396   -29
397   -28
398   -14
399   -27
Name: Age, Length: 400, dtype: int64

In [8]:
X1_squ=np.square(X1_sub)
X1_squ

0        9
1      169
2       16
3       25
4        9
      ...
395    576
396    841
397    784
398    196
399    729
Name: Age, Length: 400, dtype: int64

In [9]:
X2_sub=(new_salary-x2)
X2_sub

0       6000
1       5000
2     -18000
3     -32000
4     -51000
       ...
395   -16000
396     2000
397     5000
398    -8000
399   -11000
Name: EstimatedSalary, Length: 400, dtype: int64

In [10]:
X2_squ=np.square(X2_sub)
X2_squ

0        36000000
1        25000000
2       324000000
3      1024000000
4      2601000000
          ...
395     256000000
396       4000000
397      25000000
398      64000000
399     121000000
Name: EstimatedSalary, Length: 400, dtype: int64

In [11]:
sum_X1X2=X1_squ+X2_squ
sum_X1X2

0        36000009
1        25000169
2       324000016
3      1024000025
4      2601000009
          ...
395     256000576
396       4000841
397      25000784
398      64000196
399     121000729
Length: 400, dtype: int64

In [14]:
eculidian_dis=np.sqrt(sum_X1X2)

In [16]:
k=2
result = np.argpartition(eculidian_dis, k)
eculidian_dis[result[:k]]

139     3.0
144    12.0
dtype: float64

In [17]:
value=df.Purchased
value

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [18]:
value.loc[139]

0

In [19]:
value.loc[144]

0